/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   swap.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mhirabay <mhirabay@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/12/03 11:44:59 by mhirabay          #+#    #+#             */
/*   Updated: 2021/12/10 09:34:44 by mhirabay         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "push_swap.h"

// 前提として同じ数値は入ることがないので、同じ数値があることへのバリデーションはつくらない
int	swap(t_lst **a)
{
	size_t	size;

	size = ft_lstsize(*a);
	if (size <= 1)
		return (false);
	ft_lstadd_front(a, (*a)->next);
	return (true);
}
